package com.dzics.data.common.base.exception.enums;

public enum CustomResponseCode {
    /**
     * 服务器繁忙稍后再试
     */
    ERR0("服务器繁忙稍后再试", ""),
    ERR01("不存在活动的站点,请重新登录", ""),
    /**
     * 用户名或者密码或用户类型不能为空
     */
    ERR1("用户名或者密码或用户类型不能为空", "User name or password or user type cannot be empty"),
    /**
     * 账号或密码错误
     */
    ERR2("账号或密码错误", "Wrong account or password"),
    /**
     * 名称已存在或相同积分已存在
     */
    ERR3("名称已存在或相同积分已存在", "Name already exists or the same score already exists"),
    /**
     * token不存在
     */
    ERR4("token不存在", "Token does not exist"),
    /**
     * 无权限
     */
    ERR5("无权限", "No permission"),
    /**
     * 账户禁用
     */
    ERR6("账户禁用", "Account disabled"),
    /**
     * 用户不存在
     */
    ERR7("用户不存在", "user does not exist"),
    /**
     * 用户类型错误
     */
    ERR8("用户类型错误", "Wrong user type"),
    /**
     * token签名错误
     */
    ERR9("token签名错误", "Token signature error"),
    /**
     * token验证错误
     */
    ERR10("token验证错误", "Token validation error"),
    /**
     * token非法参数
     */
    ERR11("token非法参数", "Illegal token parameter"),
    /**
     * 检查JSON参数是否真确,必传字段是否传递
     */
    ERR12("检查JSON参数是否正确,必传字段是否传递", ""),
    /**
     * 用户已存在
     */
    ERR53("用户已存在", ""),
    /**
     * 站点不存在
     */
    ERR13("站点不存在", ""),
    /**
     * 角色编码已存在
     */
    ERR14("角色编码已存在", ""),
    /**
     * 权限编码已存在
     */
    ERR15("权限编码已存在", ""),
    /**
     * 无可切换站点
     */
    ERR16("无可切换站点", ""),
    /**
     * 无数据
     */
    ERR17("无数据", ""),
    /**
     * 添加菜上级目录和菜单类型冲突
     */
    ERR18("添加菜上级目录和菜单类型冲突", ""),
    /**
     * 选择登录站点
     */
    ERR19("选择登录站点", ""),
    /**
     * 请先给站点授权
     */
    ERR20("请先给站点授权", ""),
    /**
     * 归属站点必填
     */
    ERR21("归属站点必填", ""),
    /**
     * 请选择添加用户类型
     */
    ERR22("请选择添加用户类型", ""),
    /**
     * 机构编码已存在,请更换机构编码
     */
    ERR23("机构编码已存在,请更换机构编码", ""),
    /**
     * 站点已禁用
     */
    ERR24("站点已禁用", ""),
    /**
     * 站点下存在用户不允许删除
     */
    ERR25("站点下存在用户不允许删除", ""),
    /**
     * 上传头像需要小于20MB
     */
    ERR26("上传头像需要小于20MB", ""),
    /**
     * 请上传正确的图片
     */
    ERR27("请上传正确的图片", ""),
    /**
     * 有角色使用当前菜单不允许删除
     */
    ERR28("有角色使用当前菜单不允许删除", ""),
    /**
     * 请删除站点中关联的菜单后删除
     */
    ERR29("请删除站点中关联的菜单后删除", ""),
    /**
     * 角色存在用户使用,请先取消
     */
    ERR30("角色存在用户使用,请先取消", ""),
    /**
     * 管理员可编辑
     */
    ERR31("管理员可编辑", ""),
    /**
     *
     */
    ERR33("订单信息错误", ""),
    /**
     * 产品配置已存在
     */
    ERR34("产品检测项配置已存在", ""),
    ERR341("改产品检测项配置不存在", ""),
    /**
     * 角色已绑定用户,请解除
     */
    ERR32("角色已绑定用户,请解除", ""),
    /**
     * 产线需绑定设备
     */
    ERR35("产线需绑定设备", ""),
    ERR351("设备不存在", ""),
    ERR352("该设备已添加", ""),
    /**
     * 方法名称、类名称、返回参数名、不能重复
     */
    ERR36("方法名称、类名称、返回参数名、不能重复", ""),
    /**
     * 编码不能重复
     */
    ERR37("编码不能重复", ""),
    /**
     * 工序ID必传
     */
    ERR38("工序ID必传", ""),
    /**
     * 工序编码已存在
     */
    ERR39("工序编号已存在", ""),
    /**
     * 排序编码已存在
     */
    ERR40("排序码已存在", ""),
    /**
     * 工序不存在
     */
    ERR41("工序不存在", ""),
    /**
     * 工件位置记录不存在
     */
    ERR42("工件位置记录不存在", ""),
    /**
     * 订单号已存在
     */
    ERR43("订单号已存在", ""),
    ERR44("工序编号已存在", ""),
    ERR45("物料信息校验错误", ""),
    ERR46("物料信息已确认", ""),
    ERR47("密码错误", ""),
    ERR48("订单数据错误,请重新新建订单后重试", ""),
    ERR49("基础配置信息不存在", ""),
    ERR50("类型值请使用 2MHSG ｜3MHSG｜ 2MGT ｜ 3MGT", ""),
    ERR51("产线中已存在执行中的订单,订单结束后可开始", ""),
    ERR52("订单不存在", ""),
    ERR91("订单已在生产中",""),
    ERR93("叫料请求时可能未正常响应,叫料记录不存在", ""),
    ERR94("请求AGV时可能未正常响应,请求响应记录不存在", ""),
    ERR941("AGV反馈处理数据未识别请求类型", ""),
    ERR95("请在后台管理设置默认运行模式", ""),
    ERR54("订单不在生产中", ""),
    ERR55("托盘号不存在", ""),
    ERR56("该产线下已存在此二维码", ""),
    ERR57("请使用创建用户账号编辑", ""),
    ERR58("AGV投料Id不存在", ""),
    ERR59("产线编号不存在", ""),
    ERR591("请选择产线", ""),
    ERR592("产线不存在", ""),

    ERR60("请求MOM接口异常", ""),
    ERR61("返回结果集 returnData 为空", ""),
    ERR62("MOM返回料框类型为空", ""),
    ERR63("工序间配送,未识别传入的操作类型", ""),
    ERR64("查询MOM料框信息接口物料清单列表为空", ""),
    ERR65("当前没有MOM订单在生产", ""),
    ERR66("一个订单的相同工位存在多种物料", ""),
    ERR67("配送物料数量不能为空", ""),
    ERR68("上料点小车未绑定工位和上料点编码", ""),
    ERR69("当前没有在生产的MOM订单", ""),
    ERR70("当前生产的订单,未查询到物料信息", ""),
    ERR71("虽然存在多种物料信息,但是根据端盖或耳环为条件未找到匹配的物料信息", ""),
    ERR72("请求MOM叫料接口异常", ""),
    ERR73("移出满料框时料框编码必传", ""),
    ERR74("接口类型 taskType 类型未识别", ""),
    ERR75("调用MOM更新投料点信息异常", ""),
    ERR76("设备状态监控,分片参数值不存在", ""),
    ERR77("同产线 工序列名已存在", ""),
    ERR78("粗加工区域主物料上料点只需要叫料", ""),
    ERR79("未收到物料二维码数据", ""),
    ERR80("查询MOM下个工序号错误", ""),
    ERR81("没有设置下料点", ""),
    ERR83("查询不到本订单所在工序号", ""),
    ERR82("当前产线还未配置相应产品", ""),
    ERR84("工序信息不存在", ""),
    ERR85("组件物料为空", ""),
    ERR86("该订单状态不允许修改", ""),
    ERR87("配送料框没有设置请求类型", ""),
    ERR88("产品不存在", ""),
    ERR89("根据订单、产线、DZICS系统定义工位未查询到SANY报工工位", ""),
    ERR90("用户已登录,先退出", ""),
    ERR96("当前AGV呼叫模式为自动模式，不允许操作", ""),
    ERR961("请配置Agv投料管理料点模式",""),
    ERR92("当前订单为异岛转发订单，不允许进行当前操作", "");

    CustomResponseCode(String chinese, String english) {
        this.chinese = chinese;
        this.english = english;
    }

    private String chinese;

    public String getChinese() {
        return chinese;
    }

    public String getEnglish() {
        return english;
    }

    private String english;

    @Override
    public String toString() {
        final StringBuilder sb = new StringBuilder("{");
        sb.append("\"chinese\":\"")
                .append(chinese).append('\"');
        sb.append(",\"english\":\"")
                .append(english).append('\"');
        sb.append('}');
        return sb.toString();
    }
}
